LukeJamesCode/GurneyAgent/firmware/gurney-speaker/sdkconfig.defaults
# Default config for the gurney-speaker firmware. `idf.py set-target esp32s3`
# generates an sdkconfig from these; override per-board values via
# `idf.py menuconfig`.

CONFIG_IDF_TARGET="esp32s3"

# More RAM for the audio frontend + Opus decoder.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# FreeRTOS tick rate — 1 kHz keeps audio buffers responsive.
CONFIG_FREERTOS_HZ=1000

# Larger main task stack so the boot orchestrator doesn't overflow when LVGL
# inits.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging: info by default; bump to debug while bringing up new hardware.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Use the custom partition table (NVS + app + storage).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WebSocket client component pulled from idf-extra-components.
CONFIG_WS_TRANSPORT=y
